{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "shopping",
    "1": "eating out",
    "2": "healthcare",
    "3": "mpesa transfers",
    "4": "deposit",
    "5": "airtime",
    "6": "transportation",
    "7": "entertainment",
    "8": "rent",
    "9": "loan payments",
    "10": "travel",
    "11": "atm withdrawals"
  },
  "initializer_range": 0.02,
  "label2id": {
    "airtime": 5,
    "atm withdrawals": 11,
    "deposit": 4,
    "eating out": 1,
    "entertainment": 7,
    "healthcare": 2,
    "loan payments": 9,
    "mpesa transfers": 3,
    "rent": 8,
    "shopping": 0,
    "transportation": 6,
    "travel": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
